package Day02;
//확대축소 ctrl shift+  (+)  (-)
//테마 ,폰트 변경 가능
//주석처리[ 코드설명 ]
public class DAY02_1 {
	//패키지이름

		//1. 모든 코드작성은 클래스{} 안에서 작성한다.
		//2. 실행할 코드는 메인 함수{} 안에서 작성한다. [스레드 : 코드 읽어주는 기능}
		//3. 자동완성 : 1~3글자 -> ctrl+스페이스바
		//4. {}안에서 tab	

		//메모리 : 컴퓨터 저장하는공간 RAM :자원
		//변수
			//1. 데이터 1개 저장하는 메모리 공간 [저장산자]
			//2. 변수 선언 [자료형 변수명;]
			//3. 변수 초기화(처음값) [자료형 변수명 = 데이터;]
		//용량 단위
			//0 혹은 1-> 1비트
			//01010101-> 8비트 -> 1바이트
			// 1024바이트-> kb -> 1024kb-> 1mb -> 
		//자료형
			//1. 메모리 아껴 쓰자
			//boolean : 1비트 참 거짓 
			//char : 2바이트 문자 1개 아스키코드 -> 유니코드(자바)
			//byte  : 1바이트 정수+-128
			//short  : 2바이트 정수 +-3만정도
			//int : 4바이트 정수 +-20억정도
			//long : 8바이트 장스 +-20억정도
			//float: 4바이트 실수(소수점) 8자리
			//double: 8바이트 실수(소수점) 18자리
			//순서만 알면 됨 빈공간->메모리 증가->속도 감소

			int value = 10; //1. 변수 선언과 초기화
			// int +=20억정도의 데이터를 저장할 수 있는 상자
				//result[아무거나] : 상자의 이름 ( 개발자가 구분하기 위해서 )
					//변수호출(변수불러오기) + 10
					// 10+ 10
				
	public static void main(String[] args) {
		
		
		
		
	}
	

}
